# Chapter 2

## Connection

In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
import sql_magic
%reload_ext sql_magic

server = 'DESKTOP-90A96QN'
database = 'Sandbox'
username = 'DESKTOP-90A96QN\krzys'
password = ''

# If logging using windows authentication, use trusted_connection=yes. This ignores username and password.
engine = create_engine(f'mssql+pyodbc://{username}:{password}@{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes')
%config SQL.conn_name = 'engine'

Connection test

In [5]:
%read_sql SELECT TOP 3 * FROM orders where customer_id = 'A'

Query started at 08:09:46 PM Central European Daylight Time; Query executed in 0.01 m

  customer_id order_id product  quantity
0           A        1    taco        10
1           A        1  burger        15
2           A        3    taco        12

# Exercises

Page 28

In [6]:
query = '''

DROP TABLE IF EXISTS orders;

CREATE TABLE orders (
	customer_id VARCHAR(50),
	order_id VARCHAR(50),
	product VARCHAR(200),
	quantity INT
	);

INSERT INTO orders (customer_id, order_id, product, quantity)
VALUES	('A','1','taco',10),
		('A','1','burger',15),
		('B','2','taco',5),
		('A','3','taco',12),
		('B','4','burger',8),
		('B','4','salad',15),
		('B','4','tomato',20),
		('A','5','taco',5),
		('A','5','salad',8),
		('A','1','burger',15),
		('D','2','taco',5),
		('D','3','taco',12),
		('E','4','burger',8),
		('A','4','salad',15),
		('B','4','tomato',20),
		('E','5','taco',5),
		('A','5','salad',8),
		('B','4','tomato',20),
		('E','5','taco',5),
		('B','5','salad',8),
		('X','4','tomato',20),
		('X','5','taco',5),
		('X','5','salad',8);

SELECT orders, COUNT(*) AS num_customers
FROM
(
	SELECT customer_id, COUNT(order_id) AS orders
	FROM orders
	GROUP BY customer_id
) AS tbl_1
GROUP BY orders;

'''

%read_sql {query}

Query started at 08:09:51 PM Central European Daylight Time; Query executed in 0.00 m

   orders  num_customers
0       2              1
1       3              2
2       7              1
3       8              1